# طباعة نص للترحيب
print("مرحبا بك في هذا الكورس")

# طباعة رقم
print(5)

# دمج نصين (Concatenation)
print("محمود " + "شعبو")

# طباعة نصوص متعددة باستخدام الفواصل
print("محمود شعبو", "شعبو", "obscure")

# الإعلان عن متغير لاسم وطباعته
name = "محمود"
print(name)

# الإعلان عن متغيرين للاسم الأول والأخير ودمجهما في متغير جديد
first_name = "محمود"
last_name = "شعبو"
full_name = first_name + " " + last_name
print(full_name)

# العمليات الحسابية الأساسية باستخدام المتغيرات
x = 3600
y = 60
print(x + y)
print(x + 60)
