# الكتابة على ملف (وضع الإحلال والتبديل) - إذا لم يكن موجودا في مساره فسيقوم بإنشائه تلقائيا
file = open("data.txt", "w", encoding="utf-8")
file.write("السلام عليكم ورحمة الله وبركاته")
file.close()

# الإضافة على ملف موجود مسبقا وتجنب مسح محتوياته (وضع الإضافة)
file = open("data.txt", "a", encoding="utf-8")
# النزول لسطر جديد قبل الكتابة لوضع النص في السطر الثاني وعدم الإلصاق
file.write("\nهذا سطر جديد تمت إضافته إلى أسفل الملف")
file.close()

# قراءة محتويات الملف بأقسامه كاملة دفعة واحدة
file = open("data.txt", "r", encoding="utf-8")
content = file.read()
print("محتوى الملف كاملا:\n" + content)

# إرجاع المؤشر للحرف والسطر الأول في الملف لإعادة القراءة دون الحاجة لإغلاقه وفتحه
file.seek(0)

# قراءة الأسطر بسطر واحد فقط (يفيد للملفات العملاقة)
first_line = file.readline()
print("\nالسطر الأول فقط:", first_line.strip())

# إرجاع المؤشر مجدداً للتجربة القادمة
file.seek(0)

# قراءة كافة الأسطر وتخزينها كقائمة للتنقل المريح والمخصص فيها بالـ Index
lines_list = file.readlines()
print("\nآخر سطر تمت قراءته في القائمة هو:", lines_list[-1])

# إغلاق الملف بعد إنهاء جميع الأعمال (مهم جدا)
file.close()
