import random    # استيراد مكتبة (random) المسؤولة عن توليد الأرقام العشوائية
import winsound  # استيراد مكتبة (winsound) للتحكم في تشغيل الأصوات على نظام ويندوز

# بدء حلقة تكرار لا نهائية (Infinite Loop) لكي تعيد اللعبة تشغيل نفسها تلقائياً بعد كل جولة
while True:
    # توليد رقم سري عشوائي صحيح يقع بين 1 و 10 وتخزينه في المتغير (secret)
    secret = random.randint(1, 10)
    # تعريف متغير (count) لعد المحاولات، ونبدأ العد من المحاولة رقم 1
    count = 1
    # بدء حلقة تكرار داخلية، تستمر في العمل طالما أن عدد المحاولات أقل من أو يساوي 5
    while count <= 5:
        # إظهار رسالة للمستخدم تطلب منه تخمين الرقم، وتخزين ما يكتبه في المتغير (answer)
        answer = input("خمن الرقم: ")
        # تحويل القيمة التي أدخلها المستخدم من "نص" إلى "رقم صحيح" (Integer) لنتمكن من مقارنتها
        answer = int(answer)
        # التحقق: هل الرقم الذي أدخله المستخدم يساوي الرقم السري؟
        if answer == secret:
            # تشغيل صوت الفوز من ملف (correct.wav) الموجود داخل مجلد (sounds)
            # الرقم 1 يرمز للأمر (SND_ASYNC) ليعمل الصوت في الخلفية دون إيقاف الكود
            winsound.PlaySound("sounds/correct.wav", 1)
            # طباعة رسالة تهنئة للمستخدم توضح أنه فاز وتذكر عدد المحاولات التي استغرقها
            print(f"ممتاز. لقد توصلت إلى الحل الصحيح خلال {count} محاولات")
            # أمر (break) للخروج من حلقة التكرار الحالية (while count <= 5) لأن المستخدم فاز
            break
        # التحقق: إذا لم تكن الإجابة صحيحة، هل الرقم المدخل أكبر من الرقم السري؟
        elif answer > secret:
            # تشغيل صوت الخطأ من ملف (error.wav) لأن التخمين غير صحيح
            winsound.PlaySound("sounds/error.wav", 1)
            # طباعة تلميح للمستخدم بأن الرقم الذي يبحث عنه أصغر مما أدخله
            print("خطأ. فكر في رقم أصغر من هذا")
        # التحقق: إذا لم يتحقق الشرطان السابقان، هل الرقم المدخل أصغر من الرقم السري؟
        elif answer < secret:
            # تشغيل صوت الخطأ مرة أخرى لأن التخمين غير صحيح
            winsound.PlaySound("sounds/error.wav", 1)
            # طباعة تلميح للمستخدم بأن الرقم الذي يبحث عنه أكبر مما أدخله
            print("خطأ. فكر في رقم أكبر من هذا")
        # زيادة عداد المحاولات بمقدار 1 بعد كل محاولة خاطئة (للانتقال للمحاولة التالية)
        count = count + 1

    # جملة (else) هذه تابعة لحلقة (while)، ويتم تنفيذها فقط إذا انتهت الـ 5 محاولات دون فوز
    else:
        # تشغيل صوت الخسارة من ملف (fail.wav)
        winsound.PlaySound("sounds/fail.wav", 1)
        # طباعة رسالة تخبر المستخدم بأنه خسر، وتكشف له الرقم السري الصحيح
        print(f"للأسف. لم تتمكن من الوصول إلى الرقم الصحيح. الإجابة هي {secret}")