
# الدوال الخاصة بالنصوص 
# s = "مرحبا"
# print(type(s))

# استخدام الدالة 
# replace 
# s = "مرحبا"
# print(s.replace("ا", "ن"))
# print(s)

# استخدام الدالة upper()
# لتكبير النص كله
# s = "welcome to this cource"
# print(s.upper())

# استخدام الدالة lower()
# لتصغير النص كله 
# s = "WELCOME TO THIS COURCE"
# print(s.lower())


# استخدام الدالة capitalize()
# لتكبير اول حرف في هذه الجملة 
# s = "welcome to this cource"
# print(s.capitalize())


# استخدام الدالة title()
# لتكبير الحرف الأول من كل كلمة 
# s = "welcome to this cource"
# print(s.title())


# استخدام دالة  isdigit()
# للتحقق من النص هل هذا النص أرقام 
# هنا طبع false 
# s = "welcome to this cource"
# print(s.isdigit())


# استخدام if الشرطية 
# مع برنامج حساب المسافة بالميل 
# هنا المستخدم يجب عليه ان يدخل رقم
# وليس نص لكي يعمل البرنامج 
# mile = input("أدخل المسافة بالميل")
# if mile.isdigit():
#     mile = int(mile)
#     km = mile * 1.62
#     print("كيلومتر", km, "هو", mile, "ميل")
# else:
#     print("لقد ادخلت قيمة غير صحيحة")


# برنامج حساب المسافة بالميل 
# من دون if الشرطية 
# mile = input("ادخل المسافة بالميل")
# mile = int(mile)
# km = mile * 1.62
# print("كيلومتر", km, "هو", mile)

# using indexing 
# indexing تبدء من الرقم 0
# طباعة الفهرس الآول ا
# s = "السلام عليكم ورحمة الله وبركاته "
# print(s[0])


# using indexing 
# طباعة الفهرس السابع 
# هنا سوف يطبع الحرف ع
# s = "السلام عليكم ورحمة الله وبركاته "
# print(s[7])


# طباعة كلمة عليكم 
# موقعها بالفهرس من 7 الى11  
# لكن هنا طبع عليك وليس عليكم 
# لنا لغة البرمجة البيثون تعتبر 
# نقطة النهاية غير مشمولة بالأقتطاع 
# لهذا قد طبع عليك وليس عليكم 
# s = "السلام عليكم ورحمة الله وبركاته "
# print(s[7:11])


# اذا اردت ان تضمن نقطة النهاية في الطباعة 
# يجب عليك ان تزيد فهرس أضافي 
# هنا سوف يطبع كلمة عليكم كاملة 
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[7:12])


# طباعة الحرف الأخير هاء 
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[-1])

# طباعة الفهارس من -7 الى -1
# هنا سوف يطبع وبركات
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[-7:-1])


# طباعة كلمة وبركاته كاملة 
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[-7:])


# طباعة من الفهرس السابع الى نهاية الفهارس 
# هناسيطبع من اول عليكم الى آخر النص 
# فتكون النتيجة على الشكل التالي 
# عليكم ورحمة الله وبركاته
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[7:])

# القفز بين الأحرف 
# هنا قفز خطوتين 
# هنا طبع اسا 
# s = "السلام عليكم ورحمة الله وبركاته"
# print(s[0:7:2])


# طريقة قلب النصوص في المتغير 
# s = "mahmoud "
# print(s[::-1])


# استخدام الدالة len لحساب طول المحتوى في المتغير 
# s = "mahmoud "
# print(len(s))


# using find "
# وظيفة هذه الدالة البحث في النصوص 
# s = "السلام عليكم ورحمة الله وبركاته مرحبا بكم في دورة البيثون "
# print(s.find("بيثون"))


#يمكن تخزين هذه الدالة في متغير منفصل 
# لتخرج نفس النتيجة 
# المتغير يخزن نقطة البداية 
# s = "السلام عليكم ورحمة الله وبركاته مرحبا بكم في دورة البيثون "
# start = s.find("بيثون")
# print(start)


# معرفة نقطة النهاية 
# s = "السلام عليكم ورحمة الله وبركاته مرحبا بكم في دورة البيثون "
# start = s.find("بيثون")
# stop = start + len("بيثون")
# print(start)
# print(stop)
# print(s[start: stop])



# انشاء برنامج يحتوي على نقطة البداية وعلى 
# نقطة النهاية بأستخدام الدالة find 
#وأيضا بأستخدام if الشرطية 
# txt = "السلام عليكم ورحمة الله وبركاته"
# search = input("ادخل عبارة البحث:")
# start = txt.find(search)
# if start == -1:
#     print("لم يتم العثور على النص المطلوب")
# else:
#     stop = start+len(search)
#     print("تم العثور على عبارة البحث عند النقطة", start, "الى النقطة", stop)



# كتابة البرنامج مرة أخرة 
# بأستخدام الطريقة الأحدث 
# لf string 
# txt = "السلام عليكم ورحمة الله وبركاته"
# search = input("ادخل عبارة البحث:")
# start = txt.find(search)
# if start == -1:
#     print("لم يتم العثور على النص المطلوب")
# else:
#     stop = start+len(search)
#     print(f"تم العثور على عبارة البحث عند النقطة {start} إلى النقطة {stop}")


# العمليات الحسابية 
# x = 6
# y = 10
# print(f"x = {y} = {x*y}")


# أنشاء برنامج حساب الميل بالكيلو متر 
# بأستخدام f string format 
# الطريقة الجديدة 
# mile = input("mile: ")
# mile = int(mile)
# km = mile * 1.62
# print(f"{mile} ميل يساوي {km} كيلومتر")


# أنشاء برنامج حساب الميل بالكيلو متر 
# بأستخدام f string format 
# الطريقة الجديدة 
# هنا قمنا بالتحكم بالأرقام العشرية في دالة الطباعة 
# mile = input("ادخل الميل: ")
# mile = int(mile)
# km = mile*1.62
# print(f"ميل يساوي {km: .2f} كيلومتر")


