# التعامل مع القوائم المتداخلة (تخزين الاسم والدرجة)
students = [["ali", 97], ["mohammed", 92], ["ahmed", 94], ["said", 96]]

# استخدام break لكسر الحلقة عند العثور على المطلوب مع for-else
name = "ahmed"
for s in students:
    if s[0] == name:
        print(f"درجة {name} هي: {s[1]}")
        break  # إيقاف البحث بعد عثورنا على الطالب
else:
    # ينفذ فقط إذا أكملت حلقة for جميع عناصر القائمة ولم يتم تشغيل أمر break
    print(f"لم يتم العثور على الطالب {name}")

# استخدام continue لتخطي تكرار وتحقيق شرط معين
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
for n in numbers:
    if n % 2 != 0:
        continue  # تخطي الأرقام الفردية والانتقال للرقم الذي يليه فورا
    print(n)      # سيتم طباعة الأرقام الزوجية فقط

# حلقات while والعداد للوقاية من الحلقات اللانهائية الخاطئة
count = 1
while count <= 5:
    print(count)
    count += 1    # خطوة هامة لضمان انتهاء الحلقة بعد وصول العداد للرقم 5

# استيراد المكتبات واستخدام الدوال بداخلها
import webbrowser
# webbrowser.open("www.google.com") # كود يفتح المتصفح الافتراضي على موقع جوجل
