




# Calculate Average Using Function
# تعريف دالة (Function) جديدة اسمها average تأخذ مدخل (قائمة) نرمز له بالحرف l
def average(l):
    # استخدام الدالة الجاهزة sum لحساب مجموع الأرقام في القائمة l وتخزينه في المتغير s
    s = sum(l)
    length = len(l)
    # إرجاع النتيجة النهائية للدالة، وهي حاصل قسمة المجموع على العدد
    return s / length

# إنشاء قائمة (List) تحتوي على مجموعة من الأرقام
numbers = [5, 4, 2, 6, 9, 10, 30, 20, 50]

# استدعاء الدالة average وتمرير قائمة numbers لها، ثم تخزين النتيجة في المتغير av
av = average(numbers)
# طباعة النتيجة النهائية التي تم تخزينها في av
print(av)