






# اسم البرنامج: الآلة الحاسبة البسيطة (Simple Calculator)

# حلقة تكرار لا نهائية ليعمل البرنامج باستمرار ولا يتوقف بعد عملية واحدة
while True:
    # طلب الرقم الأول من المستخدم
    x = input("أدخل الرقم الأول: ")
    # تحويل الرقم الأول من نص إلى عدد صحيح
    x = int(x)

    # طلب نوع العملية الحسابية من المستخدم
    o = input("أدخل العملية الحسابية بين العمليات التالية (+-*/): ")

    # طلب الرقم الثاني من المستخدم
    y = input("أدخل الرقم الثاني: ")
    # تحويل الرقم الثاني من نص إلى عدد صحيح
    y = int(y)

    # التحقق: إذا كانت العملية هي جمع (+)
    if o == "+":
        print(x + y)
    
    # التحقق: إذا كانت العملية هي طرح (-)
    elif o == "-":
        print(x - y)

    # التحقق: إذا كانت العملية هي ضرب (*)
    elif o == "*":
        print(x * y)

    # التحقق: إذا كانت العملية هي قسمة (/)
    elif o == "/":
        print(x / y)