





# استدعاء مكتبة المتصفح لفتح الروابط
import webbrowser
# إنشاء قاموس فارغ لتخزين الروابط
urls = {}
# رسالة ترحيبية
print("مرحباً بك في مخزن الروابط")
# حلقة تكرار لا نهائية لضمان استمرار عمل البرنامج
while True:
    # طلب اختيار من المستخدم (1 للفتح، 2 للإضافة)
    option = input("اكتب الرقم 1 اذا كنت ترغب في فتح واحد من الروابط المضافة، أو اضغط 2 اذا كنت تريد إضافة رابط جديد: ")

    # إذا اختار المستخدم رقم 1
    if option == "1":
        # جلب قائمة بأسماء المواقع المخزنة
        keys = list(urls.keys())
        print("الروابط المتوفرة:")        
        # التحقق إذا كانت القائمة فارغة
        if keys == []:
            print("لا توجد عناصر مضافة")
        else:
            # طباعة كل اسم موقع موجود في القائمة
            for key in keys:
                print(key)
            # طلب اسم الموقع المراد فتحه من المستخدم
            name = input("اكتب اسم الموقع الذي تريد فتحه: ")            
            # محاولة جلب الرابط من القاموس
            try:
                link = urls[name]
            # في حال حدوث خطأ لأن الاسم غير موجود
            except KeyError:
                print("هذا الموقع غير موجود")
                continue
            # فتح الرابط في المتصفح
            webbrowser.open(link)
    # إذا اختار المستخدم رقم 2 للإضافة
    elif option == "2":
        key = input("اكتب الاسم الظاهري للموقع الذي تريد إضافته: ")
        link = input("ألصق الرابط هنا: ")
        
        # إضافة الاسم والرابط إلى القاموس
        urls[key] = link