# # قائمة تحتوي على قوائم فرعية، كل قائمة فرعية بها: [الاسم، الدرجة]
# students = [["ali", 97], ["mohammed", 92], ["ahmed", 94], ["said", 96]]
# # نطلب من المستخدم إدخال الاسم الذي يريد البحث عنه
# name = input("أدخل إسم الطالب الذي تريد درجته: \n")
# # نبدأ حلقة تكرارية للمرور على كل طالب في القائمة
# for s in students:
#     # التحقق: هل الاسم الموجود في الخانة الأولى (s[0]) يطابق الاسم المدخل؟
#     if s[0] == name:
#         # إذا وجدنا الاسم، نطبع الدرجة الموجودة في الخانة الثانية (s[1])
#         # نستخدم f‑string لدمج النص مع المتغير بسهولة
#         print(f"درجة {name} هي {s[1]}")


# # هنا وضعنا شرط else في حال لم يتم كسر الحلقة ببريك
# # ولم يوجد الأسم المطلوب في القائمة تنفذ فورا else
# # قائمة تحتوي على قوائم فرعية، كل قائمة فرعية بها: [الاسم، الدرجة]
# students = [["ali", 97], ["mohammed", 92], ["ahmed", 94], ["said", 96]]
# # نطلب من المستخدم إدخال الاسم الذي يريد البحث عنه
# name = input("أدخل إسم الطالب الذي تريد درجته: \n")
# # نبدأ حلقة تكرارية للمرور على كل طالب في القائمة
# for s in students:
#     # التحقق: هل الاسم الموجود في الخانة الأولى (s[0]) يطابق الاسم المدخل؟
#     if s[0] == name:
#         # إذا وجدنا الاسم، نطبع الدرجة الموجودة في الخانة الثانية (s[1])
#         # نستخدم f‑string لدمج النص مع المتغير بسهولة
#         print(f"درجة {name} هي {s[1]}")
#         # break يكسر الحلقة فوراً ويخرج منها
#         break

# else:
#     # هذا الجزء ينفذ فقط إذا انتهت الحلقة دون تنفيذ break
#     print(f"لم يتم العثور على الطالب  {name}")


# استخدام مفهوم continue  في الحلقة التكرارية for
# قائمة بأسماء
names = ["ahmed", "ali", "khalid"]
for n in names:
    # إذا كان الاسم هو "ali
    if n == "ali":
        # continue تعني: تجاهل ما تبقى من الكود داخل هذه الدورة وانتقل مباشرة للدورة التالية
        continue
    # سيتم تخطي طباعة "ali" بسبب الأمر continue
    print(n)


# استخدام continue في الأرقام في الحلقة for
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
for n in numbers:
    # الشرط: إذا كان باقي قسمة الرقم على 2 لا يساوي صفر، أي أن الرقم فردي
    if n % 2 != 0:
        print(f"سنتجاوز هذا الرقم {n} لأنه رقم فردي")
        # تخطَّ هذا الرقم (لا تطبعه) وعد للدورة التالية
        continue

    # سيصل البرنامج إلى هنا فقط إذا كان الرقم زوجيًا
    print(n)


# استخدام الحلقة التكرارية while
# بداية العداد
count = 1
# while تعني: طالما أن الشرط (count <= 10) صحيح، نفّذ الكود بالداخل
while count <= 10:
    # اطبع الرقم الحالي
    print(count)
    # خطوة مهمة جداً: زيادة العداد بمقدار واحد
    # لو نسينا هذا السطر، ستبقى قيمة count = 1 للأبد وسيحدث تكرار لا نهائي
    count = count + 1


# البرنامج النهائي: نظام بحث عن درجات الطلاب يعمل باستمرار باستخدام while True و القوائم المتداخلة
# تجهيز قاعدة بيانات الطلاب (قائمة داخلها قوائم فرعية للاسم والدرجة)
students = [["ali", 97], ["mohammed", 92], ["ahmed", 94], ["isa", 96]]
# حلقة لا نهائية ليعمل البرنامج باستمرار وللطلب من المستخدم مراراً
# حلقة لا تنتهي إلا بأمر break
while True:
    # طلب الأسم من المستخدم
    name = input(
        "أدخل اسم الطالب الذي تريد معرفة درجته (أو 'q' للخروج من البرنامج): \n"
    )
    # شرط الخروج من البرنامج بناء على أمر المستخدم للإنهاء
    if name == "q":
        print("جاري إغلاق البرنامج")
        # كسر حلقة while الرئيسية وإغلاق البرنامج
        break
    # حلقة for للبحث في قائمة الطلاب
    # بدء عملية البحث داخل القائمة المتداخلة بمجرد أن المستخدم أدخل اسم وليس 'q'
    for s in students:
        # فحص: هل الاسم المعطى في القائمة الفرعية يطابق الاسم المدخل؟
        if s[0] == name:
            print(f"درجة الطالب {name} هي {s[1]}")
            # التوقف عن البحث لأننا وجدنا الطالب، والعودة إلى حلقة while الرئيسية
            break

    else:
        # حالة عدم العثور (for...else): تنفذ فقط إذا بحثنا في كامل القائمة ولم نجد الاسم
        print(f"الإسم {name} غير موجود في قاعدة البيانات")


# المكتبات في python
# استيراد مكتبة متصفح الويب (webbrowser) الموجودة ضمن مكتبة بايثون القياسية
import webbrowser

# استخدام الدالة open الموجودة داخل المكتبة لفتح رابط موقع جوجل
# أستدعاء الدالة open من المكتبة بكتابة أسم المكتبة أولا
webbrowser.open("https://google.com")

# يمكن استيراد الدالة open فقط بدلاً من استيراد كل المكتبة
from webbrowser import open
# الآن يمكننا استخدام open مباشرة بدون كتابة webbrowser قبلها
open("https://google.com")
