# النسخة النهائية من برنامج الآلة الحاسبة
# هنا سوف نعالج خطأ  اذا قام المستخدم بأدخال نص بدلا من رقم
# حلقة تكرار لا نهائية لضمان عمل البرنامج باستمرار
while True:
    # استقبال المدخلات كنصوص أولاً
    x = input("أدخل الرقم الأول: \n")
    o = input("أدخل العملية الحسابية بين العمليات التالية (+-*/): \n")
    y = input("أدخل الرقم الثاني: \n")
    # المنطقة الخطرة الأولى: تحويل النص إلى رقم

    # محاولة تحويل النصوص إلى أرقام (هنا قد يحدث الخطأ إذا أدخل المستخدم أحرفاً)
    try:
        x = int(x)
        y = int(y)
    # except: إذا حدث خطأ من نوع ValueError (قيمة غير صحيحة)، نفذ هذا الكود البديل

    except ValueError:
        # أمر continue يتجاهل باقي الكود ويعود فوراً لبداية الحلقة while True لطلب الإدخال مجدداً
        continue

    # تنفيذ العمليات الحسابية بناءً على اختيار المستخدم
    if o == "+":
        print(x + y)
    elif o == "-":
        print(x - y)
    elif o == "*":
        print(x * y)
    elif o == "/":
        # المنطقة الخطرة الثانية: القسمة
        # نجرب القسمة، لكننا نحذر من القسمة على صفر

        # محاولة القسمة مع مراعاة خطأ القسمة على صفر
        try:
            print(x / y)
        # إذا حاول المستخدم القسمة على صفر
        except ZeroDivisionError:
            print("خطأ: لا يمكن القسمة على صفر")
